# ПАМЯТКА: Основы Python
# Переменные: name = "Tom", age = 22
# Типы данных:
#   int (целые): 1, 10, -5
#   float (дробные): 3.14, 0.5
#   str (строки): "Hello", 'World'
#   bool (булево): True, False
# print(x) - вывод на экран
# input("Enter: ") - ввод с клавиатуры (всегда возвращает строку!)
# int("10") - преобразование строки в число
# f"Hello, {name}" - f-строка (вставка переменных)

# Домашнее задание: Основы Python

# 1. Создайте переменные разных типов:
# - Целое число (int)
# - Вещественное число (float)
# - Строка (string)
# - Булево значение (bool)
# Выведите их на экран с помощью print().
# Ваш код:

# 2. Создайте две строковые переменные 'first_name' и 'last_name'.
# Сложите их (конкатенация) через пробел и выведите результат.
# Ваш код:

# 3. Запросите у пользователя имя с помощью input() и выведите приветствие,
# используя f-строку (например, "Привет, Иван!").
# Ваш код:

# 4. Преобразование типов:
# Создайте строковую переменную со значением "123".
# Преобразуйте её в число, прибавьте 10 и выведите результат.
# Ваш код:

# 5. Математические операции:
# Посчитайте остаток от деления 15 на 4.
# Посчитайте возведение 2 в степень 5.
# Ваш код:

# 6. Создайте переменную со значением 3.14159.
# Выведите её, округлив до 2 знаков после запятой (используя round() или форматирование).
# Ваш код:

# 7. Длина строки:
# Запросите у пользователя вводе любого слова.
# Выведите количество символов в этом слове.
# Ваш код:

# 8. Множественное присваивание:
# Присвойте значения x=5, y=10, z=15 в одной строке.
# Выведите сумму этих переменных.
# Ваш код:

# 9. Поменяйте местами значения двух переменных a и b без использования третьей временной переменной.
a = 100
b = 200
# Ваш код:
print(f"a = {a}, b = {b}")

# 10. Булевы операции:
# Проверьте, правда ли, что 10 больше 5 и при этом 5 не равно 5.
# Выведите результат (True или False).
# Ваш код:
